[
  "Company: 1inch\n                    Title: Build a novel extension for 1inch Cross-chain Swap (Fusion+)\n                    Description: Build a novel extension for 1inch Cross-chain Swap (Fusion+) that enables swaps between Ethereum and one of the following non-EVM chains: Sui, Aptos, Bitcoin/Bitcoin cash/Doge/Litecoin, Tron, Ton, Monad, Near, Starknet, Cardano, Stellar, XRP Ledger, ICP, Tezos, Polkadot, EOS, or Cosmos. (Solana is excluded because we have already built it) It is required to directly integrate with the 1inch Limit Order Protocol contract code on the EVM side for this bounty.\n                    Prizes: $6,000 for 1st place, $4,000 for 2nd place, $2,000 for 3rd place",
  "Company: 1inch\n                    Title: Build advanced strategies and hooks for the 1inch Limit Order Protocol\n                    Description: Build advanced strategies and hooks for the 1inch Limit Order Protocol. Project ideas: Develop an options hook, Integrate concentrated liquidity, TWAP swap, Other creative projects are welcome. Existing examples built on top of Limit Order Protocol include ranged sells and dutch auctions.\n                    Prizes: $3,000 for 1st place, $2,000 for 2nd place, $1,500 for 3rd place",
  "Company: 1inch\n                    Title: Utilize 1inch's infrastructure to build your application\n                    Description: Utilize 1inch's infrastructure to help build your application - Build with our swap protocols (1inch Cross-chain Swap (Fusion+), Intent-based Swap (Fusion), Classic Swap, limit order protocol) - Build with any of our data APIs (price feeds API, wallet balances API, token metadata API, and many more) - Use our Web3 API to interact with the blockchain.\n                    Prizes: Up to 5 teams will receive $300",
  "Company: Rootstock\n                    Title: Build practical DeFi applications on Rootstock and/or RIF technologies\n                    Description: Build practical DeFi applications on Rootstock and/or RIF technologies. We’re looking for accessible, efficient tools that redefine everyday finance, with a special emphasis on generating native bitcoin yield. Yield farming strategies, Lending protocols, Decentralized exchanges (DEXs), Liquidity pools.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Rootstock\n                    Title: Build high-quality decentralized applications (dApps) on Rootstock\n                    Description: Build high-quality decentralized applications (dApps) on Rootstock and unleash your creativity. We’re looking for innovative solutions and while not required, integrating AI-driven tools or techniques will earn you bonus points for showcasing advanced innovation. DeFi Automation Agents, Smart Contract Assistants, Cross-Chain Interoperability Agents, Decentralized Governance Helpers.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Rootstock\n                    Title: Build anything that puts the RIF token to work on Rootstock\n                    Description: Build anything that puts the RIF token to work on Rootstock; bonus points for slick, one-step UX and creative token utility. RIF one-click staking; bridge or swap then stake in a single flow, RIF staking inside a Telegram mini-app; think MEW-style but in TG, AI bot that answers English questions by querying Collective Graph subgraphs, RIF-POAPs; mint event badges or sub-domain NFTs paid in RIF, Social-content rewards in RIF; track on-chain engagement then tip users, x402 payments; ship a lightweight SDK that lets devs accept USDRIF with Coinbase’s agentic standard.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Flow\n                    Title: Consumer-Oriented Killer Apps\n                    Description: Consumer-oriented “killer apps” have the power to define and lead entire industries by solving real user pain points at scale. Think of how ChatGPT made AI accessible to hundreds of millions. Flow is designed for mass adoption and consumer-grade experiences, so we’re looking for the next breakthrough application that can capture the interest of millions (or billions!) of everyday users. This is a very broad bounty and eligible projects include everything from AI Agents and RWA to games and social apps.\n                    Prizes: ['$3,000', '$2,000', '$1,000']",
  "Company: Flow\n                    Title: Top Use of Automation & Actions\n                    Description: Flow Actions (FLIP-338) are a brand-new standard that turn protocol logic into self-contained, reusable onchain building blocks you can call without importing ABIs, reading contract code, or writing brittle glue scripts. Each Action is a trustless workflow with clear metadata, built-in safety checks, atomic execution, and verifiable success criteria—think standardized onchain APIs that plug together like Lego bricks. For AI agents, this means instant discovery of available protocols, safe composition of complex workflows, and full automation without off-chain keepers or MCP servers. This bounty is calling on builders to push the boundaries by creating new connectors to major protocols, chaining cross-protocol workflows, integrating Actions into games, integrating fully onchain agents with actions, or making tools that help others discover and use useful Actions. Whether you’re into DeFi, gaming, or novel automation, this is your chance to shape the future of composability and define how agents interact with Web3.\n                    Prizes: ['$3,000', '$1,000']",
  "Company: Pyth Network\n                    Title: Use Pyth Pull oracle to power up your dapp\n                    Description: Use Pyth Pull oracle to power up your dapp. The prize will go to the top three teams with best and most innovative use of Pyth Price feeds.\n                    Prizes: ['$2,500', '$1,500', '$1,000']",
  "Company: Pyth Network\n                    Title: Use Pyth Entropy to generate and consume random number on chains\n                    Description: Use Pyth Entropy to generate and consume random number on chains. Anyone can permissionless generate random number on-chain. This pool prize will be given to most Innovative apps to use Pyth Entropy.\n                    Prizes: $2,500",
  "Company: Hedera\n                    Title: Build innovative applications, agents, tooling, or infrastructure that combine AI/ML with Hedera network services\n                    Description: Build innovative applications, agents, tooling, or infrastructure that combine AI/ML (including LLMs and autonomous agents) with Hedera network services. The focus is on demonstrating novel AI-blockchain integrations that create real utility for developers or end-users.\n                    Prizes: ['$2,000', '$1,500']",
  "Company: Hedera\n                    Title: Build and deploy innovative Smart Contract based applications on Hedera\n                    Description: Build and deploy innovative Smart Contract based applications on Hedera. The focus is on leveraging Hedera's EVM compatibility and integration into the Ethereum ecosystem.\n                    Prizes: ['$2,000', '$1,500']",
  "Company: Polygon\n                    Title: Build an Agentic Payments project using x402 on Polygon\n                    Description: Build an Agentic Payments project using x402 on Polygon. Project ideas: Micropayments / Subscription sign-up using EthGlobal NFC bracelet, Agentic payment flows for everyday purchases, Private payments options for agents, Agent-run point of sale with: Refunds management, dispute resolution system, transaction tracking and analysis, reconciliation features.\n                    Prizes: ['$3,500', '$2,500', '$2,000', '$1,250', '$750']",
  "Company: ENS\n                    Title: ENS Integration\n                    Description: Any type of ENS integration is eligible for this prize. Get creative! An example of a successful project may be a smart contract wallet that mints an ENS subname on L2 and sets its primary name upon deployment. If you're building an AI project, consider how ENS can be used to name autonomous agents.\n                    Prizes: ['$3,500', '$2,000', '$1,500 ×3']",
  "Company: World App\n                    Title: Mini Apps\n                    Description: Show us your best Mini Apps! Projects that build and deploy a Mini App using MiniKit are eligible for this prize.\n                    Prizes: ['$4,000', '$3,000', '$2,000', '$500 ×2']",
  "Company: Uniswap Foundation\n                    Title: Uniswap v4 Hooks\n                    Description: Uniswap v4 introduces Hooks, smart contracts that let developers customize swap fees, liquidity logic, and trading behavior at the protocol level. This bounty is an open track for projects that push the limits of what’s possible in DeFi innovation using Hooks, with bonus points for those deploying on Unichain.\n                    Prizes: ['$4,000', '$3,000', '$2,000', '$1,000']",
  "Company: Filecoin\n                    Title: Build the next generation of decentralized applications using Synapse SDK\n                    Description: Build the next generation of decentralized applications using Synapse SDK to access Filecoin’s new warm storage service and payment rails. We are seeking applications that demonstrate real-world utility, a seamless developer experience, and the unique capabilities of services from Filecoin Onchain Cloud, powered by the Synapse SDK. We’re excited to see applications that use storage and USDFC payments seamlessly, from user-generated content and AI datasets to escrow, subscriptions, or pay-per-use services. Key Primitives to Explore: 1. Build Apps with Innovative Storage Economics: Use Filecoin warm storage service for innovative applications like on-chain governance, Immutable File Sharing, decentralized social or video platform, etc. 2. Boost AI infrastructure: Data storage is the key for AI, and Filecion warm storage is ready to boost any AI use cases, including verifiable AI-training datasets, fair AI training economy, or decentralized Retrieval-Augmented Generation (dRAG), etc. 3. Toolings: Explore other services or toolings added to enrich the capability of Filecoin Onchain Cloud: KYC services, access control, privacy services.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Filecoin\n                    Title: Build innovative DataDAOs using Lighthouse\n                    Description: Build innovative DataDAOs that showcase the power of Lighthouse as a data tokenisation platform. We want to see Data DAOs, encrypted storage, and real-world data feeds integrated directly into decentralized applications. Steps: Data DAOs — Create Data DAOs where community members contribute and monetize data via DataCoins. Datastored permanently on Filecoin via Lighthouse. Register data coin on Lighthouse data tokenisation platform. Storage + Token Gating — Use Lighthouse SDK for storage and token-based access control. zkTLS / Verifiable Data Feeds — Use zkTLS or other cryptographic proofs to ingest/validate real-world data (e.g. Social Feed, DeFi oracles, off-chain APIs). On-Chain Deployment — Deploy your DAO and data contracts to Base, Polygon, or Filecoin mainnet. Live Real-World Data — Projects must integrate at least one live real-world dataset or API feed.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Filecoin\n                    Title: Use Akave O3 for decentralized storage applications\n                    Description: Use Akave O3, an S3-compatible API—keep your familiar S3 workflow while building on decentralized storage. Pick one of the following tracks to build: AI/ML datasets & checkpoints, Cross-cloud analytics (External Tables), Iceberg lakehouse on Akave, Edge/DePIN ingest, Immutable backup & DR.\n                    Prizes: Up to 2 teams will receive $2,500",
  "Company: Citrea\n                    Title: Build new Bitcoin Applications\n                    Description: Citrea enables a whole new area of Bitcoin Applications. This also covers new DeFi primitives. In this track we expect you to build new Bitcoin Applications that suits Bitcoin well. Some examples are as follows: BTC Options & Structured Products: on-chain options, covered calls, yield vaults. Privacy Trading / Dark Pools: anti-MEV trading, hidden order books with ZK. Money Markets: non-custodial lending/borrowing for BTC or BTC-correlated assets. Miners’ Tools: incentive/hedging tools, payout rails, dashboards. Note: if you apply to this track, you can apply to Innovation track at the same time, it's fine.\n                    Prizes: $4,500 for 1st place, $1,500 for 2nd place",
  "Company: Citrea\n                    Title: Innovation track for Bitcoin applications\n                    Description: You have some other ideas that fits to the spirit of Bitcoin? Private unstoppable money? Bitcoin x AI x Citrea? RWAs using Bitcoin? Community oriented ₿apps like ROSCA? Super complex infra? Then this track is for you. Anything novel that uses Citrea meaningfully and pushes Bitcoin UX forward.\n                    Prizes: $3,000 for 1st place, $1,000 for 2nd place",
  "Company: The Graph\n                    Title: Innovative Project Using Substreams or Token API\n                    Description: Build an innovative project that integrates The Graph’s data products—Substreams or Token API—to deliver real-world utility, insight, or AI-enhanced functionality. Projects should demonstrate technical creativity and effective use of onchain data. Bonus points for AI-driven solutions that leverage MCP servers to enable agentic or natural-language capabilities.\n                    Prizes: ['$3,000', '$2,000']",
  "Company: The Graph\n                    Title: High-Impact Application Using Knowledge Graph Framework\n                    Description: Build a high-impact application using the Knowledge Graph Framework to organize and query public web3 data in a composable and structured way. Examples and ideas: - Crypto Projects Directory: Structured registry of projects organized by category, type, and industry - Investment Graph: Dataset mapping project-investor relationships into a rich network - Dapp Registry: Extensible list of decentralized applications by domain and function - DAO Governance Explorer: Visualization of governance proposals, voting, and outcomes across DAOs\n                    Prizes: ['$2,500', '$1,500']",
  "Company: The Graph\n                    Title: Decentralized Application Using GRC-20-ts Library\n                    Description: Build a decentralized application that utilizes the GRC-20-ts TypeScript library to publish offchain knowledge to the Knowledge Graph. This bounty rewards creative use of the GRC-20-ts library to attach meaningful metadata to smart contracts, protocols, or dapps. Example Use Cases: - Publishing protocol descriptions or governance rules - Publishing offchain data through GRC20-ts to the Knowledge Graph\n                    Prizes: Not specified",
  "Company: Artificial Superintelligence Alliance\n                    Title: ASI:One and MeTTa Integration\n                    Description: Awarded to the team that shows the most effective and creative use of ASI:One for human–agent interaction, paired with MeTTa for structured reasoning. Judged on problem choice, solution quality, and real-world impact.\n                    Prizes: $3,500",
  "Company: Artificial Superintelligence Alliance\n                    Title: Agentverse Launch\n                    Description: Awarded to the team with the most impactful, well-presented launch on Agentverse. Your listing should be easy to find via ASI:One and clearly explain how MeTTa powers your logic. Judges look for usability, discoverability, clear purpose, and adoption potential.\n                    Prizes: $2,500",
  "Company: Artificial Superintelligence Alliance\n                    Title: Multi-Agent System\n                    Description: Awarded to the team that builds the most cohesive multi-agent system using Fetch.ai agents and MeTTa for shared knowledge and reasoning. We’ll evaluate how smoothly agents communicate, collaborate, and coordinate complex tasks across chains and environments.\n                    Prizes: $1,750",
  "Company: Artificial Superintelligence Alliance\n                    Title: Agent Collaboration Demonstration\n                    Description: Awarded to the team that delivers the most innovative demonstration of agent collaboration within the ASI:One ecosystem. Judges will look for originality, technical depth, and potential for future scalability.\n                    Prizes: $1,250",
  "Company: Artificial Superintelligence Alliance\n                    Title: User-Facing Experience\n                    Description: Awarded to the team with the most polished user-facing experience that makes advanced human–agent interaction intuitive and engaging. Judged on design quality, accessibility, and clarity of value to end users.\n                    Prizes: $1,000",
  "Company: PayPal\n                    Title: Powerful and Scalable Real-World Use Case for PYUSD\n                    Description: Awarded to the project that most convincingly demonstrates a powerful and scalable real-world use case for PYUSD. The winner will set a new benchmark for digital payments, showing how PYUSD unlocks unique value—whether by powering global remittances, revolutionizing commerce, or creating new economic opportunities. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: PayPal\n                    Title: Seamless and Engaging Consumer Payment Experience with PYUSD\n                    Description: This prize recognizes the project that builds the most seamless and engaging consumer payment experience with PYUSD at its core. From streamlining cross-border settlements, to enabling microtransactions, programmable subscriptions, or “pay-as-you-go” economics, we want to see fresh ideas that push the boundaries of what’s possible in digital payments. Think outside the box—your solution should inspire new thinking for the entire PYUSD ecosystem. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: PayPal\n                    Title: Creative Use of PYUSD in Applications\n                    Description: This award honors creative thinkers who push the boundaries of where and how PYUSD can be used in applications—whether social, gaming, education, finance, or something completely unexpected. This is all about thinking outside the wallet and uncovering new ways digital dollars can unlock value in apps and platforms. Whether it’s a beautifully designed wallet, a seamless onboarding journey, or something that goes viral within the community, this prize celebrates projects that put people first. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: 0G\n                    Title: Production-Ready Applications and Developer Tooling on 0G Mainnet\n                    Description: This track rewards developers who build production-ready applications and essential developer tooling directly on 0G Mainnet (EVM Chain). We want to see projects that demonstrate real-world utility and contribute to the 0G mainnet ecosystem's growth - whether through innovative dApps or tools that make building on 0G easier.\n                    Prizes: ['$3,000', '$2,500', '$2,000', '$1,500', '$1,000']",
  "Company: Self Protocol\n                    Title: Onchain Identity Verification with Self SDK\n                    Description: We are looking for interesting use cases of using the Self onchain SDK in your contracts. Self Smart contracts verify proofs, manage a merkle tree of identity commitments and allow for onchain disclosure of data while guaranteeing the permissionless aspect of the protocol. Using the Self.xyz SDK, allows a user to disclose their country, age (or range), that they are not on OFAC or from a sanctioned country, and verify that proof that onchain on the Celo network, or offchain, without sharing any private information with third parties. Since this month, you can not only prove your identity with your passport or ID, but Self has just launched Aadhaar card support, and we want to see your best use cases!\n                    Prizes: $5,000 for 1st place, $2,500 for 2nd place, $1,500 for 3rd place",
  "Company: Self Protocol\n                    Title: Offchain Identity Verification with Self SDK\n                    Description: Integrate Self offchain SDK into your application so users can prove their identity! Check out the Quickstart to see how quickly you can implement the Self SDK into your dApp.\n                    Prizes: Not specified",
  "Company: Fluence\n                    Title: Impactful Use of Fluence Virtual Servers\n                    Description: A total of $5,000 will be awarded to the most impactful use of Fluence Virtual Servers. Demonstrate a working project using CPU-only VMs from Fluence. Expectations include efficient AI application deployed on Fluence VMs, such as small/quantized models, inference APIs, agentic LLM backends. Ideally, build toward CPU-only compatibility, no GPUs required.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Kadena\n                    Title: Build a dApp or Developer Tool Harnessing Kadena’s Multiple Parallel Chains\n                    Description: Build a dApp or developer tool that harnesses Kadena’s multiple parallel chains. This could be a novel multichain dApp, a middleware that connects separate chains, or simple tooling to simplify multichain development. Show us how your project leverages the power of Kadena’s multi-chain model specifically.\n                    Prizes: Not specified",
  "Company: Kadena\n                    Title: Deploy a Unique dApp or Integration Connecting Kadena to External Ecosystems\n                    Description: Deploy a unique dApp or work on an integration that connects Kadena to external ecosystems. Whether you’re porting an existing Ethereum dApp (DeFi, NFT, gaming, DAO), building a brand new product from scratch, or integrating Kadena with wallets, liquidity layers, or middleware. Your product should show how Kadena can drive retail user adoption.\n                    Prizes: Not specified",
  "Company: Kadena\n                    Title: Design a Project for Institutional or TradFi Applications on Kadena\n                    Description: Design a project that shows how Kadena can power institutional or TradFi applications. This could include real-world assets (RWAs), tokenized securities, enterprise finance solutions, compliance-focused tooling, or infrastructure that bridges traditional finance with blockchain. The goal is to highlight Kadena’s potential in real-world, large-scale, and regulated environments.\n                    Prizes: Not specified",
  "Company: Ethereum Foundation\n                    Title: Unified ZK Registry System\n                    Description: Build solutions to unify registry systems across formats like documents proofs, passports, AA, etc.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: NFC Feature Exploration\n                    Description: Further developments on NFC feature integration with Mopro, such as utilizing chips embedded in ETHGlobal wristbands for proof generation, focusing on UX and DevEx.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Credential Sharing\n                    Description: Prove professional qualifications (degrees, licenses) stored as digitally signed PDFs and generate interesting use cases.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Mobile Gaming\n                    Description: ZK-based mobile games using the Mopro stack, such as ZK Escape Room, ZK Werewolf.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Matching Apps\n                    Description: Zero-knowledge powered matching applications across multiple domains like dating or job matching scenarios.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Walrus\n                    Title: Applications that use Walrus storage\n                    Description: Focus on an app idea where decentralized storage solves a real pain point, examples include hosting for NFTs, democratized access to AI models, or crowdsourced video streaming.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Walrus\n                    Title: Developer tools for Walrus\n                    Description: Build something that helps developers integrate with Walrus more easily, such as SDKs, caching layers, streaming utilities, blob management tools, and more.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Integra\n                    Title: Real Estate Tokenization and Compliance\n                    Description: Push boundaries in applying blockchain to real estate, from tokenization to compliance rails, asset registries to new user experiences, exploring how security tokens could transform real estate.\n                    Prizes: $1,000",
  "Company: LayerZero\n                    Title: Most Innovative Omnichain Solution\n                    Description: Create the most innovative omnichain solutions using LayerZero V2. Leverage our permissionless infrastructure and composable execution to win!\n                    Prizes: $10,000 for 1st place, $6,000 for 2nd place, $3,500 for 3rd place, $500 for Best Developer Feedback",
  "Company: SKALE\n                    Title: Gas-Free Blockchain Applications\n                    Description: SKALE is the gas-free blockchain network. Blockchain has made itself a clear solution for developers looking to innovate in the world of finance and programmable money, however, few blockchains in the space can boast high throughput, sustainable economics, infinite scalability, and zero gas fees. Come build an application that makes use of the zero gas fee network and enables amazing experiences for end users. Build anything you want, but we have listed some possible target categories for exploration: - Consumer Applications with Invisible Web3 User Experiences - Financial Rails - Micro Transactions (come see the workshop)\n                    Prizes: $3,000 for 1st place, $2,000 for 2nd place (x4), $1,000 for 3rd place (x4), $500 for 4th place (x4)",
  "Company: SKALE\n                    Title: SKALE Native Functionality\n                    Description: Deploy to one of our four SKALE testnets and make use of the SKALE Native functionality to bring your project to the next level. Native SKALE functionality found in requirements.\n                    Prizes: $1,000 for up to 3 teams",
  "Company: Uniswap\n                    Title: Implement a Hook\n                    Description: Implement a hook, leveraging first-class features Ideas / Scope: * Dynamic Fees: showcase potential hooks that rely on dynamic fees to reward LPs or swappers * Custom Curves: showcase hooks swapping on a custom curve * Hook Fees: showcase novel hook fee designs for value redistribution, MEV capture, single-token fees, token flywheels * NoOp/async swaps * General Hooks: use of hook functions * Liquidity-managing hooks: hooks which automate or streamline liquidity management\n                    Prizes: $4,000 for 1st place, $3,000 for 2nd place, $2,000 for 3rd place",
  "Company: Uniswap\n                    Title: Integrations with Uniswap v4\n                    Description: Integrations with Uniswap v4, including periphery contracts, infrastructure, and user abstractions. Research and experiments are also eligible. A catch-all category for anything using Uniswap v4, but is not directly implementing a hook. Examples include, but are not limited to: - Pool Operators (periphery): Contracts that call PoolManager - Infrastructure / SDKs / Developer Tooling - swap and stake, stake-able ERC6909 - Ponder schemas - general-purpose Uniswap X filler for Uniswap v4 - v4’s liquidity donation for value-distribution - Parallel transaction simulation - Testing toolkits - Hook backtesting - User Abstraction - Liquidity management - Leverage products, lending systems - Cross-chain intents with ERC-7683 - MEV/LVR Research\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Uniswap\n                    Title: Deploy a DeFi App to Unichain Sepolia\n                    Description: Deploy a DeFi app to Unichain Sepolia. Topics particularly interesting by the Uniswap Foundation: - Tokenomics & issuance mechanisms - Uniswap v4 - Leverage and Credit\n                    Prizes: $2,000 for 1st place, $1,250 for 2nd place, $750 for 3rd place, $250 ×2 for Honorable Mentions",
  "Company: Polygon Labs\n                    Title: Consumer Applications\n                    Description: Create consumer applications focusing on real world use cases, using Polygon technology.\n                    Prizes: $2,000 for 1st place, $1,000 ×5 for Runner-up",
  "Company: Polygon Labs\n                    Title: AI Integration with Smart Contracts\n                    Description: Develop innovative AI solutions that leverage blockchain technology for decentralized applications, with project ideas including AI wearables, on-chain inference validation, data sourcing incentive model, AI powered blockchain applications, and AI protection on blockchain security.\n                    Prizes: $2,000 for 1st place, $1,000 ×2 for 2nd place",
  "Company: Polygon Labs\n                    Title: Unified Bridge Implementation\n                    Description: Develop a fully functional implementation of the unified bridge that allows seamless transfer of Ethereum across different chains without wrapping, with project ideas including cross-chain DAO and cross-chain wallet.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place",
  "Company: Polygon Labs\n                    Title: Zero-Knowledge Technology Applications\n                    Description: Develop secure and privacy-preserving applications on Polygon using zero-knowledge (zk) technology, with ideas including Plonky3, Privado ID, and SP1.\n                    Prizes: $2,000 for 1st place, $1,000 ×4 for 2nd place",
  "Company: Sign\n                    Title: Sign Protocol Core Functionality\n                    Description: Sign Protocol is an omni-chain attestation protocol, enabling users to freely attest and retrieve structured and verifiable data onchain. This prize will be given to two project teams using Sign Protocol to add core functionality to their project.\n                    Prizes: Up to 3 teams will receive $2,000",
  "Company: Sign\n                    Title: Encrypted Attestations\n                    Description: This prize will be granted to two project teams that store and use encrypted data in their attestations. For your idea, consider protocols that aid in conditionally decrypting encrypted attestations, such as Lit Protocol. As an example, you could selectively share your location or a trip itinerary as encrypted attestations that will only be viewable by friends and family.\n                    Prizes: Up to 3 teams will receive $2,000",
  "Company: Sign\n                    Title: Consumer Applications\n                    Description: Sign Protocol offers a suite of tools, infrastructure, and standards to create a future where all claims and assertions on the web and the world around us are driven by verifiable attestations. This prize category will be granted to the best projects showcasing consumer applications. Consumer applications can include games, communication platforms, online shopping experiences, and any other application designed to meet the needs of consumers.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Sign\n                    Title: Schema Hooks Utilization\n                    Description: Sign Protocol’s Schema Hooks allow builders to extend the core attestation protocol, adding custom Solidity logic that is triggered each time an attestation is created or revoked for a specific schema. Schema hooks can whitelist attesters, receive payments, or perform any custom application logic. This prize will be granted to two project teams that each must utilize at least one schema hook in their core project logic in a unique, technical, and innovative way.\n                    Prizes: Not specified",
  "Company: AirDAO\n                    Title: Most Innovative and Impactful Application\n                    Description: In this category, we seek the most innovative and impactful application built on the AirDAO network. Participants are encouraged to leverage the full potential of AirDAO's ecosystem and develop applications that demonstrate technical excellence, creativity, and real-world use cases. The sky's the limit, and we welcome any app idea that showcases AirDAO's capabilities, whether in DeFi, NFTs, decentralized governance, or any other field.\n                    Prizes: $5,000",
  "Company: AirDAO\n                    Title: Attention Economy Solutions\n                    Description: This category focuses on projects that attract and retain users’ attention and offer a pathway to monetization using the AirDAO network. We are looking for solutions that effectively harness user engagement, whether through advertising, content creation, or community-driven growth strategies, and capitalize on the growing trend of the attention economy. Projects should have a clear plan for converting attention into tangible value within the AirDAO ecosystem.\n                    Prizes: 1st place: $2,500, 2nd place: $1,500, 3rd place: $1,000",
  "Company: AirDAO\n                    Title: AI and Blockchain Integration\n                    Description: This category invites participants to explore the intersection of artificial intelligence (AI) and blockchain technology within the AirDAO network. We seek innovative projects integrating AI to enhance the performance, functionality, or intelligence of applications running on AirDAO. Whether in predictive analytics, AI-driven decision-making, or enhancing user experiences, the possibilities for leveraging AI to elevate the blockchain space are endless.\n                    Prizes: 1st place: $2,500, 2nd place: $1,500",
  "Company: Flow\n                    Title: Most Killer App Potential\n                    Description: Killer apps have the power to create and lead entire industries by addressing a pain point at the perfect moment. As an L1 blockchain designed for mass adoption and consumer-grade products, we believe the next breakthrough will emerge in the form of a Consumer App. Consumer Apps are consumer products that solve real-world problems by placing the end-user at the heart of the experience. Unlike traditional DeFi or “x-to-earn” products that can feel distant to the average consumer, Flow seeks applications that are accessible, intuitive, and valuable to millions (or billions!). Think ChatGPT for artificial intelligence (AI), and how it made AI approachable and useful for hundreds of millions, enabling even non-experts to create custom AI tools.\n                    Prizes: 1st place: $4,000, 2nd place: $3,000, 3rd place: $2,000, 4th place: $500 ×2",
  "Company: Flow\n                    Title: Web3 Sports\n                    Description: The global sports industry is expected to exceed $623 billion by 2026, driven by data, analytics, media, and technology. The Flow blockchain is central to this transformation, powering leading Web3 sports platforms like NBA Top Shot (with over $2 billion transacted), NFL ALL DAY, and other major sports collectibles. Flow is changing fan interactions by enabling immersive experiences, data-driven engagement, and new revenue models. With Flow, you can build the next generation of sports apps, and connect with engaged communities across the ecosystem. Web3 Sports Use Cases: Player-Owned Data, Tokenized Fan Engagement, Decentralized AI Fantasy Leagues, OnChain Sports Predictions, Play-to-Earn Sports Games, Composability, Real World Asset Tokenization.\n                    Prizes: Up to 4 teams will receive $2,000",
  "Company: Flow\n                    Title: Best Developer Feedback\n                    Description: Awarded to the developer (or team) who provides the most valuable feedback on the developer experience while building on Flow. Although the $500 prize is reserved for one winner, we will be offering additional prizes to ALL teams who submit feedback (see requirements below) alongside their project.\n                    Prizes: $500",
  "Company: Flow\n                    Title: Pool Prize\n                    Description: The Pool Prize will be evenly distributed to all qualifying projects (excluding those that win a separate prize).\n                    Prizes: Split with up to 5 teams (capped at $300 per team)",
  "Company: Gnosis\n                    Title: Prize details coming soon\n                    Description: Gnosis is a collective of aligned projects revolutionizing payments infrastructure to make decentralized financial tools accessible and usable for all. The Gnosis ecosystem is underpinned by Gnosis Chain, a highly secure, resilient, and decentralized EVM Layer 1 network and also includes the venture-building arms, Gnosis Studio which includes Gnosis Pay, Circles, Hashi, Metri wallet and Gnosis AI Labs team. These projects are creating a radically inclusive infrastructure helping bridge the gap between blockchain technology and practical, everyday applications/use cases. Gnosis Chain is operated by a diverse set of 200k validators around the world. It is one of the Ethereum’s first sidechains focused on resilience and credible neutrality as its core values. Gnosis Chain has fast transaction time of 5 seconds and low transaction fees. For instance, for 500 transactions $0.01 xDAI is required. The ecosystem support is ever growing, hence making it a perfect choice for developers to build dApps on-chain!\n                    Prizes: Prize details coming soon",
  "Company: The Graph\n                    Title: Build and deploy a custom subgraph\n                    Description: Build and deploy a custom subgraph that indexes data from a smart contract to query blockchain data for your dapp.\n                    Prizes: $2,500 for 1st place, $1,250 for 2nd place",
  "Company: The Graph\n                    Title: Query a new or existing subgraph\n                    Description: Query a new or existing subgraph on the Graph Explorer or hosted service using the public query URL from the subgraph dashboard\n                    Prizes: $2,500 for 1st place, $1,250 for 2nd place",
  "Company: The Graph\n                    Title: Use a new or existing substream\n                    Description: Use a new or existing substream to process and consume web3 data. This includes the use of Substreams-powered subgraphs.\n                    Prizes: Not specified",
  "Company: Lit Protocol\n                    Title: Utilize Decrypting and Combining Within an Action\n                    Description: Utilize the 'Decrypting and Combining Within an Action' feature to decrypt data within Lit and compute over that data using a Lit Action. We welcome applications and protocols that leverage Lit for computing over private data across a wide variety of domains, including AI, Identity, and more.\n                    Prizes: Not specified",
  "Company: Lit Protocol\n                    Title: Implement Sign within a Lit Action\n                    Description: Implement the 'Sign within a Lit Action' method to sign and broadcast transactions using Lit Actions. We are looking for applications and protocols that leverage Lit for signing and broadcasting transactions across various areas such as Chain Abstraction, Identity, Wallets, and more.\n                    Prizes: Not specified",
  "Company: Lit Protocol\n                    Title: Noteworthy projects\n                    Description: This prize will be divided among up to four teams that build noteworthy projects not selected for other prizes.\n                    Prizes: $500 for up to 6 teams",
  "Company: Circle\n                    Title: Build a seamless UX for near-instant payments\n                    Description: Build a seamless UX that uses USDC and/or EURC to deliver near-instant payments and financial services for your business and/or your end users.\n                    Prizes: Not specified",
  "Company: Circle\n                    Title: Build a chain-abstracted user experience using Cross Chain Transfer Protocol (CCTP)\n                    Description: Build a chain-abstracted user experience using Cross Chain Transfer Protocol (CCTP): -an on-chain utility for moving USDC securely between blockchains via native burning and minting. Please note it is required to interact directly with Circle’s CCTP smart contracts and not just Chainlink’s CCIP\n                    Prizes: Not specified",
  "Company: Circle\n                    Title: Build with Circle’s Web3 Services\n                    Description: Build with Circle’s Web3 Services, which are composable APIs and SDKs for secure wallets, smart contracts, and more. Option to include one or both of the below * Programmable Wallets: APIs and SDKs for creating and managing secure wallet infrastructure. Embed secure wallets in your app with an API for sponsoring blockchain network gas fees for users. * Smart Contract Platform: APIs for building, managing, and deploying smart contracts.\n                    Prizes: $2,500 for 1st place",
  "Company: XMTP\n                    Title: MessageKit\n                    Description: MessageKit is a powerful framework that simplifies the process of building messaging bots on XMTP. With its robust set of tools and integrations, you can quickly create bots that can handle integrate web3 primitives like on chain transactions, mints, games, groups and smart wallets. Ideas: Conversation is the new UI. Use a bot to interact with your project instead of building a frontend or backend Get your bot ready in 10 minutes Tipping Bots: Facilitate peer-to-peer tipping within chats, rewarding helpful or interesting contributions. Betting Bots: Allow users to place bets on events or outcomes within the chat. Game Bots: Engage users with interactive games like Wordle, Rock Paper Scissors, or trivia. Transaction Bots: Assist users with executing and confirming transactions directly within the chat. Alpha Bots: Share alpha information, market insights, and exclusive updates. AI Agents: Implement web3 crypto AI agents that can performa transactions and manage services.\n                    Prizes: Up to 4 teams will receive $2,500",
  "Company: Essential\n                    Title: Pint DeFi Primitives\n                    Description: Our Pint (short for “programmable intents”) is Essential’s DSL for declarative smart contracts. The term declarative means that code written in Pint is focused on defining logic and not execution. This prize will be awarded to the teams that deliver the most polished DeFi primitives using Pint. Projects should feature smart contracts written in Pint, as well as a user-friendly front-end (if relevant to the project). Ideal use cases include, but are not limited to: Token contract or NFT contract AMM Name service Lending protocol Orderbook DEX Perps DEX Options protocol English or Dutch auction mechanisms\n                    Prizes: 1st place $8,000, Runners Up $1,000 ×2",
  "Company: Coinbase Developer Platform\n                    Title: Innovative Onchain Experiences\n                    Description: Your goal is to use the CDP SDK to create innovative, unique experiences that push the status quo of what’s possible using onchain apps. We’re looking for projects with practical value that leverage the benefits of being onchain, the programmability of MPC Wallets, and the customizability enabled through streamlined API calls.\n                    Prizes: 1st place $2,000, 2nd place $1,000",
  "Company: Coinbase Developer Platform\n                    Title: AI and Crypto Financial Rails\n                    Description: AI agents can’t get bank accounts, so we believe that crypto will provide the financial rails necessary to unlock the true power of AI. With CDP’s programmable MPC Wallets, AI agents can send and receive payments to/from people, as well as other AI agents. For this prize, create an interesting project that uses AI and incorporates the CDP SDK. One project idea to get you thinking is an AI-enabled onchain game: An onchain game (e.g. dungeon crawler or puzzle) that creates and deploys itself using an autonomous agent, or that has AI NPCs with onchain access.\n                    Prizes: Not specified",
  "Company: Coinbase Developer Platform\n                    Title: Stablecoins and Fintech Use Cases\n                    Description: Stablecoins are the backbone of much of the crypto-economy, and fintech apps are how many people first begin interacting onchain. For this prize, create an interesting project primarily focused on stablecoins or a novel fintech usecase that incorporates the CDP SDK. One project idea to get you thinking is a Smart Savings Account: an application that uses AI to automatically allocate users' funds between different DeFi savings and investment options based on their goals and risk tolerance, with continuous optimization.\n                    Prizes: Not specified",
  "Company: Rootstock\n                    Title: Build a Top-Tier EVM dApp on Bitcoin\n                    Description: Give freedom to your mind or follow trending narratives, while building a top-tier EVM dApp on top of Bitcoin using Rootstock technology. Explore topics like Real World Assets (RWA) Tokenization, Decentralized Physical Infrastructure Networks (DePIN), Cross-Chain Bridges and Interoperability, AI, Ordinals or Runes, Privacy-Preserving Smart Contracts.\n                    Prizes: $4,000 for Winner, $500 for Honorable Mention",
  "Company: Rootstock\n                    Title: Create an Everyday DeFi Application\n                    Description: Create an everyday DeFi application using the Rootstock network and/or RIF technologies, such as lending protocols, decentralized exchanges, yield farming strategies, liquidity pools, insurance protocols, decentralized credit scoring, or trading bots.\n                    Prizes: $5,000 for Winner, $500 for Honorable Mention",
  "Company: Hedera\n                    Title: Build on Hedera Network\n                    Description: Build anything you like. Submissions that use multiple Hedera services will be prioritized. Otherwise, submissions are prioritized based on the order of submission.\n                    Prizes: Up to 4 teams will receive $1,500",
  "Company: Walrus\n                    Title: Build on Walrus Network\n                    Description: Tusked Champions will split the pool of $10,000 prize evenly. We are looking for project teams that display genuine interests in learning and building on Walrus.\n                    Prizes: Up to 5 teams will receive $2,000",
  "Company: Chronicle Protocol\n                    Title: Best Use of Chronicle Oracles\n                    Description: Unlock new possibilities with Scribe, Chronicle Protocol's cost-efficient oracles! Leverage our diverse oracle solutions across 10 supported chains to power your next big idea. Whether you're building a game with dynamic pricing, crafting a reputation system, or designing an advanced analytics dashboard, Chronicle's robust, chain-agnostic infrastructure provides the flexibility and performance to fuel your innovation. Show us what you can create and surprise us with your unique use cases!\n                    Prizes: $2,750 for 1st place, $2,000 for 2nd place",
  "Company: Chronicle Protocol\n                    Title: Best DeFi Application Powered by Chronicle Oracles\n                    Description: Build a DeFi application powered by Chronicle Protocol’s Oracles. Potential examples include lending protocols, decentralized exchanges, yield farming strategies, liquidity pools, stablecoins, prediction markets, decentralized insurance, decentralized credit score applications, trading bots, etc. The prize will go to the top teams with the best DeFi integration of Chronicle's Scribe cost-efficient Oracles.\n                    Prizes: $2,750 for 1st place, $2,000 for 2nd place",
  "Company: Ledger\n                    Title: Best Use of Ledger Tech\n                    Description: Use any combination of the following: —> Integrate Ledger into your app (web/desktop/mobile), using the LedgerJS library (difficulty: 2/5) —> Create your own embedded app/plugin, cloning the Ledger boilerplate app: Develop your own plugin (difficulty: 3/5) Develop your own device app to interact with any chain, sideload it (difficulty: 5/5) Implement Security Key (passkey) authentication (difficulty: 1/5) —> Integrate your EVM-based dApp in Ledger Live, using our developer API tools (using the Ledger Wallet API, difficulty: 2.5/5) —> Your own, creative implementation!\n                    Prizes: $5,000 for 1st place",
  "Company: Nethermind\n                    Title: Blockchain and Robotics Integration\n                    Description: As autonomous systems such as robots, drones, and IoT devices become more integrated into our lives, their security, reliability, and transparency are paramount. We invite you to innovate at the intersection of robotics and blockchain technology. We are particularly interested in verifiable computing applications, where blockchain and cryptography can be leveraged to ensure the integrity and trustworthiness of autonomous systems - or make these systems more secure and independent. - Blockchain-Enabled Decision Making: A robot or drone that logs its decisions on a blockchain, ensuring transparency and immutability of its operational history. - Device Security: An agent security system using blockchain to securely manage firmware updates, data transmissions, and interactions, protecting against tampering and unauthorized access. - Decentralized Autonomous Robotic Networks: A network of autonomous systems that allow agents to share information about their surroundings and make decisions collectively using a decentralized blockchain framework. This includes networks which allow robots or aerial platforms to securely navigate their environment self-sufficiently without reliance on external navigations systems (e.g. GNSS, Cellular Triangulation).\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Nethermind\n                    Title: Zero-Knowledge Proofs in Deep Learning and Ethereum\n                    Description: This bounty invites submissions that advance the use of Zero-Knowledge (ZK) proofs in the realms of large-scale deep learning models (e.g., LLMs) and/or the Ethereum ecosystem. We seek projects that explore novel applications, enhancements, and implementations of ZK technology to address challenges in privacy, scalability, and efficiency. Submissions may focus on one or more of the following areas: Proof Systems for Deep Learning Inference: Design and partial implementation of proof systems for the inference of large deep learning models, offering new benefits or trade-offs over current systems. Innovations or improvements to existing proof schemes are welcome; building a completely new system is not required. Applications Leveraging Efficient Deep Learning Inference: Develop applications that utilize efficient inference of deep learning models. Innovation in proving inference is optional, but excellence in application development is key. Zero-Knowledge Proofs in Ethereum and Layer 2 Solutions: Use ZK proofs to enhance privacy, scalability, and functionality within Ethereum and Layer 2 networks. Projects aligning with Vitalik’s singularity roadmap or zkEVM solutions, improving proof aggregation, or creating educational tools are encouraged. Proof Aggregation and Optimization: Enhance scalability through proof aggregation, advances in SNARK folding, or optimizing SNARK/STARK systems. Novel ZK Applications: Surprise us with a project that utilizes ZK in new ways!\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Dynamic\n                    Title: Best Game Using Dynamic.xyz\n                    Description: This prize is awarded to the best game that is fully playable, uses web3, and creates the most engaging experience while using Dynamic.xyz. For example, you can use our access gating to control access to areas and levels or collaboration. You can create the full user profile with our user management tools such as custom fields, and more.\n                    Prizes: Not specified",
  "Company: Dynamic\n                    Title: Next Native App with Dynamic.xyz\n                    Description: Build the next native app that's going to explode in popularity because it's fun to use, and incentivizes you to use it with others. Ensure it solves for a positive use case, rather than grabbing attention with dark patterns.\n                    Prizes: Not specified",
  "Company: Dynamic\n                    Title: Crypto-Enabled Real Use Case with Dynamic.xyz\n                    Description: Use crypto to enable a real use case in an interface you wouldn't yet expect to be able to - think cars, hardware, gaming consoles, IoT and more!\n                    Prizes: Not specified",
  "Company: Dynamic\n                    Title: Web3 Onboarding with Dynamic.xyz\n                    Description: For this prize winner, their users will have onboarded to web3 without even realizing, and used as much of it as possible to do practical things. Reach web2 where they are, show them how much better life can be with web3, and that it takes zero effort to switch.\n                    Prizes: Not specified",
  "Company: ENS\n                    Title: Creative ENS Use Cases\n                    Description: Most people understand ENS' simple use cases (name → address lookup, address → name lookup, etc.), but few explore what else it can be used for. For inspiration, think about naming AI agents or auto-rotating addresses on each name resolution for privacy applications.\n                    Prizes: $2,500 for up to 2 teams",
  "Company: ENS\n                    Title: Any ENS Integration\n                    Description: Any type of ENS integration is eligible for this prize, from developer tools to consumer social apps that use ENS for identity. Get creative! An example of a successful project may be a smart contract wallet that mints an ENS subname upon deployment, or unique use cases for text records. If you're building an AI project, consider how ENS can be used to name autonomous agents.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Unlimit\n                    Title: Seamless Crypto Payments\n                    Description: Create seamless crypto payments using Unlimit’s infrastructure. It should unlock new use cases for e-commerce and Web 2.0 companies to enable purchases using digital assets (coins and stablecoins). Ensure that the demo utilizes our APIs and that the transaction is successful.\n                    Prizes: Not specified",
  "Company: Unlimit\n                    Title: NFT Checkouts\n                    Description: Build an app that integrates Unlimit’s on/off ramps with NFT purchases using a credit card or an APM we support. This will bring Web3 transactions closer to the community. The transaction should be seamless and successful in any of the networks that we currently operate.\n                    Prizes: Not specified",
  "Company: Unlimit\n                    Title: Name Extensions Wallet Identifiers\n                    Description: Innovate around wallet identifiers (ENS and such) to create new ways for users to interact with our On/Off Ramps through name-based wallet extensions.\n                    Prizes: Not specified",
  "Company: Neon EVM\n                    Title: Develop a EVM-based application leveraging Solana’s infrastructure and Neon composability\n                    Description: Develop a EVM-based application that leverages Solana’s unique infrastructure and Neon composability feature and provides practical business or user value. This could involve creating a decentralized finance (DeFi) application, an NFT marketplace, or a gaming platform that operates across both chains. Examples may include but are not limited to - Cross-Chain DeFi Aggregator or Yield Farming - Platform where Solana NFTs can be traded and fractionalized using EVM-based protocols - Solana-Based Payment Integration for EVM dapps\n                    Prizes: $3,000",
  "Company: Zircuit\n                    Title: Best Project Deployed on Zircuit\n                    Description: The best project that deploys on Zircuit will win this prize. The code should be well engineered, tested, and have a compelling use case. These gems are the projects that will inspire future hackathon projects because of their outstanding quality. Remember: deploying on Zircuit is as easy as changing your endpoint in your favorite development framework. As long as the contracts are deployed on Zircuit and verified, the project is eligible. A successful submission will include a functional prototype that solves the problem it’s intended to address. It will showcase some innovation/creativity, either through technological or UI improvements. It may be complete and solve a long-standing open problem or introduce something with a lot of potential for future development. Either way, it has an impact on the Zircuit ecosystem. Winning projects should have a user-centered design that makes it easy for the target audience. This can be end users or developers integrating the project into their own codebase. The best may also include clean and consistent visual designs. Any interesting blockchain applications are welcome. Novel ideas are more impressive than clones of existing projects, though there are certainly times where clones include significant improvements. Those that are very technical may impress the judges if done correctly but simpler ideas may be easier to do well. This bounty will be judged based on completeness, execution, and creativity.\n                    Prizes: Not specified",
  "Company: Zircuit\n                    Title: Integrate Zircuit into a web3 project\n                    Description: Integrate Zircuit into your favorite web3 project. Bring Zircuit to wallets, dev tools, bridges, or any other dApp. Grow the Zircuit Ecosystem by connecting Zircuit to the best that web3 has to offer. Success looks like Zircuit running with an on- or off-chain app or tool that didn’t support it before. The integration should be correct and functional, but does not need to be complicated. Some integrations can be as simple as adding a chain ID or a node URL to a file. The project should have an impact on the Zircuit ecosystem by expanding its reach. This bounty will be judged based on completeness, usefulness, execution, and creativity.\n                    Prizes: Not specified",
  "Company: Zircuit\n                    Title: Best DeFi protocols on Zircuit\n                    Description: Zircuit’s EVM compatibility means that everything can scale, securely. Apply your hacking skills to generate the best APY or improve the user experience of DeFi for the masses on Zircuit. This prize will be split among the best DeFi protocols that deploy on Zircuit, with quality, security, and novelty being the deciding factors. Remember: deploying on Zircuit is as easy as changing your endpoint in your favorite development framework and a project is eligible as long as the contracts are deployed on Zircuit and verified. These DeFi protocols are the ones that will launch a new DeFi summer. Your project should be clearly identifiable as a DeFi protocol. Quality, completeness, and security are paramount. A protocol that lets you (or others!) steal from your users is not a winning submission. Use cases should be well thought out and documented. Through superior UI/UX or novel use cases for staking, your project should aim to give well established DeFi juggernauts cause for concern. This bounty will be judged based on completeness, execution, and creativity.\n                    Prizes: Not specified",
  "Company: Phala Network\n                    Title: dstack SDK and Agent Contract Bounty\n                    Description: Our prize highly recommends to use the dstack SDK vs building on Agent Contract. Agent Contract only implementations will only be considered for 3rd place prize The dstack-sdk is designed to simplify the steps for developers to deploy programs to CVM (Confidential VM), and to follow the security best practices by default. We are offering the first developer friendly version of dstack to allow devs to get creative and build kickass dApps that have the freedom to attract users in and outside of web3. Bonus Bounty - Ledger Nano X up for Grabs! 🚀 for 1st place and top 10 ETHGlobal Finalists\n                    Prizes: $3,000 for 1st place, $1,500 for 2nd place, $500 for 3rd place",
  "Company: Nouns\n                    Title: Public Goods Infrastructure\n                    Description: We invite everyone to submit projects that may benefit the Web3 ecosystem by building public goods, aka public infrastructure. We are looking for any app with a visual interface in the following categories: voting tools, grants and capital deployment, DAO tooling, and Ethereum utility tools. Always keep the Nouns vibe and include Nouns art!\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Alchemy Account Kit\n                    Title: Consumer-Ready Mainstream Applications\n                    Description: Prizes will go towards teams that create the most consumer-ready, mainstream applications that will bring the world onchain. Build something that users can’t put down using Account Kit.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Fhenix\n                    Title: Fhenix Ecosystem Full-Stack Applications\n                    Description: Fhenix is an L2 on ETH that uses Fully Homomorphic Encryption (FHE) to provide confidentiality. For our track, we are looking for developers who are interested in building full-stack applications in the Fhenix ecosystem that use encrypted computation. This can be anything from on-chain social media, dark pools, private lending, confidential voting, etc. We’re open to ideas and look forward to seeing what you and your team come up with!\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: DELV\n                    Title: Best Feedback on Developer Experience\n                    Description: Given to one developer (or team) who provides the best feedback related to developer experience while building on Hyperdrive.\n                    Prizes: Up to 3 teams will receive $1,500",
  "Company: NEAR\n                    Title: AI and Web3 Integration\n                    Description: Bring AI and Web3 together to enable a user-owned internet that guarantees privacy and ownership of data and assets, where everyone can be a builder. Some ideas to explore: Build autonomous agents and explore their on-chain interaction on Near Build an interface on near.social to deploy autonomous agents Add AI capabilities to our Explorer to help users better understand what is happening on-chain Enable ML research and independent contributions through programmable insentives Anything that comes to mind!\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Blockless\n                    Title: Best dApp on Blockless Platform\n                    Description: Win $1650 for building the best showcase of a dApp on the Blockless Platform.\n                    Prizes: Up to 2 teams will receive $825",
  "Company: Avail\n                    Title: Avail DA Integration\n                    Description: Build your project that utilizes AvailDA’s expandable blobspace meaningfully or build a project that helps developer/user experience and improves the Avail ecosystem. - Deploy an appchain for consumer applications. - Deploy a custom L2/L3 for innovative ZK, LLM, Robotics, etc. - Use Stackr to create a Micro-Rollup (application-specific chain) with Avail used as DA. - Use zkSync's ZK Stack to launch your own Rollup with Avail DA and launch any of your apps on it. - Use Arbitrum Orbit with Avail DA to deploy your appchain. - Use Polygon zkEVM/CDK powered by Avail to deploy your appchain.\n                    Prizes: $500",
  "Company: Avail\n                    Title: Avail Documentation Testing\n                    Description: Test our docs. These docs have been written for a long time, and we want an honest feedback! You have to perform ANY of the tasks below and give your feedback for this in a .md file and a github repo with images of testing. * Test out OP stack end-to-end * Test out ZK stack end-to-end * Test out Arbitrum Orbit end-to-end * Test out avail-js, avail-go, avail-deno, and avail-rust * Any other examples and feedback on the docs\n                    Prizes: Not specified",
  "Company: Privy\n                    Title: Consumer App Experience for Viral Adoption\n                    Description: This prize is awarded to the team that builds a consumer app experience that's most likely to drive viral adoption.\n                    Prizes: Not specified",
  "Company: Stackr\n                    Title: Innovative Micro-Rollup Application\n                    Description: Our Micro-Rollup SDK is versatile and can support a multitude of use-cases. We'd like to be surprised by a new innovative application built using the framework. Be creative and 'build whatever'. We encourage third-party integrations. NOTE: Use Avail as your Data Availability (DA) layer to become eligible for Avail’s bounties and win additional prizes!\n                    Prizes: Not specified",
  "Company: 1inch\n                    Title: Build a novel extension for 1inch Cross-chain Swap (Fusion+)\n                    Description: Build a novel extension for 1inch Cross-chain Swap (Fusion+) that enables swaps between Ethereum and one of the following non-EVM chains: Sui, Aptos, Bitcoin/Bitcoin cash/Doge/Litecoin, Tron, Ton, Monad, Near, Starknet, Cardano, Stellar, XRP Ledger, ICP, Tezos, Polkadot, EOS, or Cosmos. (Solana is excluded because we have already built it) It is required to directly integrate with the 1inch Limit Order Protocol contract code on the EVM side for this bounty.\n                    Prizes: $6,000 for 1st place, $4,000 for 2nd place, $2,000 for 3rd place",
  "Company: 1inch\n                    Title: Build advanced strategies and hooks for the 1inch Limit Order Protocol\n                    Description: Build advanced strategies and hooks for the 1inch Limit Order Protocol. Project ideas: Develop an options hook, Integrate concentrated liquidity, TWAP swap, Other creative projects are welcome. Existing examples built on top of Limit Order Protocol include ranged sells and dutch auctions.\n                    Prizes: $3,000 for 1st place, $2,000 for 2nd place, $1,500 for 3rd place",
  "Company: 1inch\n                    Title: Utilize 1inch's infrastructure to build your application\n                    Description: Utilize 1inch's infrastructure to help build your application - Build with our swap protocols (1inch Cross-chain Swap (Fusion+), Intent-based Swap (Fusion), Classic Swap, limit order protocol) - Build with any of our data APIs (price feeds API, wallet balances API, token metadata API, and many more) - Use our Web3 API to interact with the blockchain.\n                    Prizes: Up to 5 teams will receive $300",
  "Company: Rootstock\n                    Title: Build practical DeFi applications on Rootstock and/or RIF technologies\n                    Description: Build practical DeFi applications on Rootstock and/or RIF technologies. We’re looking for accessible, efficient tools that redefine everyday finance, with a special emphasis on generating native bitcoin yield. Yield farming strategies, Lending protocols, Decentralized exchanges (DEXs), Liquidity pools.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Rootstock\n                    Title: Build high-quality decentralized applications (dApps) on Rootstock\n                    Description: Build high-quality decentralized applications (dApps) on Rootstock and unleash your creativity. We’re looking for innovative solutions and while not required, integrating AI-driven tools or techniques will earn you bonus points for showcasing advanced innovation. DeFi Automation Agents, Smart Contract Assistants, Cross-Chain Interoperability Agents, Decentralized Governance Helpers.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Rootstock\n                    Title: Build anything that puts the RIF token to work on Rootstock\n                    Description: Build anything that puts the RIF token to work on Rootstock; bonus points for slick, one-step UX and creative token utility. RIF one-click staking; bridge or swap then stake in a single flow, RIF staking inside a Telegram mini-app; think MEW-style but in TG, AI bot that answers English questions by querying Collective Graph subgraphs, RIF-POAPs; mint event badges or sub-domain NFTs paid in RIF, Social-content rewards in RIF; track on-chain engagement then tip users, x402 payments; ship a lightweight SDK that lets devs accept USDRIF with Coinbase’s agentic standard.\n                    Prizes: Up to 2 teams will receive $2,000",
  "Company: Flow\n                    Title: Consumer-Oriented Killer Apps\n                    Description: Consumer-oriented “killer apps” have the power to define and lead entire industries by solving real user pain points at scale. Think of how ChatGPT made AI accessible to hundreds of millions. Flow is designed for mass adoption and consumer-grade experiences, so we’re looking for the next breakthrough application that can capture the interest of millions (or billions!) of everyday users. This is a very broad bounty and eligible projects include everything from AI Agents and RWA to games and social apps.\n                    Prizes: ['$3,000', '$2,000', '$1,000']",
  "Company: Flow\n                    Title: Top Use of Automation & Actions\n                    Description: Flow Actions (FLIP-338) are a brand-new standard that turn protocol logic into self-contained, reusable onchain building blocks you can call without importing ABIs, reading contract code, or writing brittle glue scripts. Each Action is a trustless workflow with clear metadata, built-in safety checks, atomic execution, and verifiable success criteria—think standardized onchain APIs that plug together like Lego bricks. For AI agents, this means instant discovery of available protocols, safe composition of complex workflows, and full automation without off-chain keepers or MCP servers. This bounty is calling on builders to push the boundaries by creating new connectors to major protocols, chaining cross-protocol workflows, integrating Actions into games, integrating fully onchain agents with actions, or making tools that help others discover and use useful Actions. Whether you’re into DeFi, gaming, or novel automation, this is your chance to shape the future of composability and define how agents interact with Web3.\n                    Prizes: ['$3,000', '$1,000']",
  "Company: Pyth Network\n                    Title: Use Pyth Pull oracle to power up your dapp\n                    Description: Use Pyth Pull oracle to power up your dapp. The prize will go to the top three teams with best and most innovative use of Pyth Price feeds.\n                    Prizes: ['$2,500', '$1,500', '$1,000']",
  "Company: Pyth Network\n                    Title: Use Pyth Entropy to generate and consume random number on chains\n                    Description: Use Pyth Entropy to generate and consume random number on chains. Anyone can permissionless generate random number on-chain. This pool prize will be given to most Innovative apps to use Pyth Entropy.\n                    Prizes: $2,500",
  "Company: Hedera\n                    Title: Build innovative applications, agents, tooling, or infrastructure that combine AI/ML with Hedera network services\n                    Description: Build innovative applications, agents, tooling, or infrastructure that combine AI/ML (including LLMs and autonomous agents) with Hedera network services. The focus is on demonstrating novel AI-blockchain integrations that create real utility for developers or end-users.\n                    Prizes: ['$2,000', '$1,500']",
  "Company: Hedera\n                    Title: Build and deploy innovative Smart Contract based applications on Hedera\n                    Description: Build and deploy innovative Smart Contract based applications on Hedera. The focus is on leveraging Hedera's EVM compatibility and integration into the Ethereum ecosystem.\n                    Prizes: ['$2,000', '$1,500']",
  "Company: Polygon\n                    Title: Build an Agentic Payments project using x402 on Polygon\n                    Description: Build an Agentic Payments project using x402 on Polygon. Project ideas: Micropayments / Subscription sign-up using EthGlobal NFC bracelet, Agentic payment flows for everyday purchases, Private payments options for agents, Agent-run point of sale with: Refunds management, dispute resolution system, transaction tracking and analysis, reconciliation features.\n                    Prizes: ['$3,500', '$2,500', '$2,000', '$1,250', '$750']",
  "Company: ENS\n                    Title: ENS Integration\n                    Description: Any type of ENS integration is eligible for this prize. Get creative! An example of a successful project may be a smart contract wallet that mints an ENS subname on L2 and sets its primary name upon deployment. If you're building an AI project, consider how ENS can be used to name autonomous agents.\n                    Prizes: ['$3,500', '$2,000', '$1,500 ×3']",
  "Company: World App\n                    Title: Mini Apps\n                    Description: Show us your best Mini Apps! Projects that build and deploy a Mini App using MiniKit are eligible for this prize.\n                    Prizes: ['$4,000', '$3,000', '$2,000', '$500 ×2']",
  "Company: Uniswap Foundation\n                    Title: Uniswap v4 Hooks\n                    Description: Uniswap v4 introduces Hooks, smart contracts that let developers customize swap fees, liquidity logic, and trading behavior at the protocol level. This bounty is an open track for projects that push the limits of what’s possible in DeFi innovation using Hooks, with bonus points for those deploying on Unichain.\n                    Prizes: ['$4,000', '$3,000', '$2,000', '$1,000']",
  "Company: Filecoin\n                    Title: Build the next generation of decentralized applications using Synapse SDK\n                    Description: Build the next generation of decentralized applications using Synapse SDK to access Filecoin’s new warm storage service and payment rails. We are seeking applications that demonstrate real-world utility, a seamless developer experience, and the unique capabilities of services from Filecoin Onchain Cloud, powered by the Synapse SDK. We’re excited to see applications that use storage and USDFC payments seamlessly, from user-generated content and AI datasets to escrow, subscriptions, or pay-per-use services. Key Primitives to Explore: 1. Build Apps with Innovative Storage Economics: Use Filecoin warm storage service for innovative applications like on-chain governance, Immutable File Sharing, decentralized social or video platform, etc. 2. Boost AI infrastructure: Data storage is the key for AI, and Filecion warm storage is ready to boost any AI use cases, including verifiable AI-training datasets, fair AI training economy, or decentralized Retrieval-Augmented Generation (dRAG), etc. 3. Toolings: Explore other services or toolings added to enrich the capability of Filecoin Onchain Cloud: KYC services, access control, privacy services.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Filecoin\n                    Title: Build innovative DataDAOs using Lighthouse\n                    Description: Build innovative DataDAOs that showcase the power of Lighthouse as a data tokenisation platform. We want to see Data DAOs, encrypted storage, and real-world data feeds integrated directly into decentralized applications. Steps: Data DAOs — Create Data DAOs where community members contribute and monetize data via DataCoins. Datastored permanently on Filecoin via Lighthouse. Register data coin on Lighthouse data tokenisation platform. Storage + Token Gating — Use Lighthouse SDK for storage and token-based access control. zkTLS / Verifiable Data Feeds — Use zkTLS or other cryptographic proofs to ingest/validate real-world data (e.g. Social Feed, DeFi oracles, off-chain APIs). On-Chain Deployment — Deploy your DAO and data contracts to Base, Polygon, or Filecoin mainnet. Live Real-World Data — Projects must integrate at least one live real-world dataset or API feed.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Filecoin\n                    Title: Use Akave O3 for decentralized storage applications\n                    Description: Use Akave O3, an S3-compatible API—keep your familiar S3 workflow while building on decentralized storage. Pick one of the following tracks to build: AI/ML datasets & checkpoints, Cross-cloud analytics (External Tables), Iceberg lakehouse on Akave, Edge/DePIN ingest, Immutable backup & DR.\n                    Prizes: Up to 2 teams will receive $2,500",
  "Company: Citrea\n                    Title: Build new Bitcoin Applications\n                    Description: Citrea enables a whole new area of Bitcoin Applications. This also covers new DeFi primitives. In this track we expect you to build new Bitcoin Applications that suits Bitcoin well. Some examples are as follows: BTC Options & Structured Products: on-chain options, covered calls, yield vaults. Privacy Trading / Dark Pools: anti-MEV trading, hidden order books with ZK. Money Markets: non-custodial lending/borrowing for BTC or BTC-correlated assets. Miners’ Tools: incentive/hedging tools, payout rails, dashboards. Note: if you apply to this track, you can apply to Innovation track at the same time, it's fine.\n                    Prizes: $4,500 for 1st place, $1,500 for 2nd place",
  "Company: Citrea\n                    Title: Innovation track for Bitcoin applications\n                    Description: You have some other ideas that fits to the spirit of Bitcoin? Private unstoppable money? Bitcoin x AI x Citrea? RWAs using Bitcoin? Community oriented ₿apps like ROSCA? Super complex infra? Then this track is for you. Anything novel that uses Citrea meaningfully and pushes Bitcoin UX forward.\n                    Prizes: $3,000 for 1st place, $1,000 for 2nd place",
  "Company: The Graph\n                    Title: Innovative Project Using Substreams or Token API\n                    Description: Build an innovative project that integrates The Graph’s data products—Substreams or Token API—to deliver real-world utility, insight, or AI-enhanced functionality. Projects should demonstrate technical creativity and effective use of onchain data. Bonus points for AI-driven solutions that leverage MCP servers to enable agentic or natural-language capabilities.\n                    Prizes: ['$3,000', '$2,000']",
  "Company: The Graph\n                    Title: High-Impact Application Using Knowledge Graph Framework\n                    Description: Build a high-impact application using the Knowledge Graph Framework to organize and query public web3 data in a composable and structured way. Examples and ideas: - Crypto Projects Directory: Structured registry of projects organized by category, type, and industry - Investment Graph: Dataset mapping project-investor relationships into a rich network - Dapp Registry: Extensible list of decentralized applications by domain and function - DAO Governance Explorer: Visualization of governance proposals, voting, and outcomes across DAOs\n                    Prizes: ['$2,500', '$1,500']",
  "Company: The Graph\n                    Title: Decentralized Application Using GRC-20-ts Library\n                    Description: Build a decentralized application that utilizes the GRC-20-ts TypeScript library to publish offchain knowledge to the Knowledge Graph. This bounty rewards creative use of the GRC-20-ts library to attach meaningful metadata to smart contracts, protocols, or dapps. Example Use Cases: - Publishing protocol descriptions or governance rules - Publishing offchain data through GRC20-ts to the Knowledge Graph\n                    Prizes: Not specified",
  "Company: Artificial Superintelligence Alliance\n                    Title: ASI:One and MeTTa Integration\n                    Description: Awarded to the team that shows the most effective and creative use of ASI:One for human–agent interaction, paired with MeTTa for structured reasoning. Judged on problem choice, solution quality, and real-world impact.\n                    Prizes: $3,500",
  "Company: Artificial Superintelligence Alliance\n                    Title: Agentverse Launch\n                    Description: Awarded to the team with the most impactful, well-presented launch on Agentverse. Your listing should be easy to find via ASI:One and clearly explain how MeTTa powers your logic. Judges look for usability, discoverability, clear purpose, and adoption potential.\n                    Prizes: $2,500",
  "Company: Artificial Superintelligence Alliance\n                    Title: Multi-Agent System\n                    Description: Awarded to the team that builds the most cohesive multi-agent system using Fetch.ai agents and MeTTa for shared knowledge and reasoning. We’ll evaluate how smoothly agents communicate, collaborate, and coordinate complex tasks across chains and environments.\n                    Prizes: $1,750",
  "Company: Artificial Superintelligence Alliance\n                    Title: Agent Collaboration Demonstration\n                    Description: Awarded to the team that delivers the most innovative demonstration of agent collaboration within the ASI:One ecosystem. Judges will look for originality, technical depth, and potential for future scalability.\n                    Prizes: $1,250",
  "Company: Artificial Superintelligence Alliance\n                    Title: User-Facing Experience\n                    Description: Awarded to the team with the most polished user-facing experience that makes advanced human–agent interaction intuitive and engaging. Judged on design quality, accessibility, and clarity of value to end users.\n                    Prizes: $1,000",
  "Company: PayPal\n                    Title: Powerful and Scalable Real-World Use Case for PYUSD\n                    Description: Awarded to the project that most convincingly demonstrates a powerful and scalable real-world use case for PYUSD. The winner will set a new benchmark for digital payments, showing how PYUSD unlocks unique value—whether by powering global remittances, revolutionizing commerce, or creating new economic opportunities. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: PayPal\n                    Title: Seamless and Engaging Consumer Payment Experience with PYUSD\n                    Description: This prize recognizes the project that builds the most seamless and engaging consumer payment experience with PYUSD at its core. From streamlining cross-border settlements, to enabling microtransactions, programmable subscriptions, or “pay-as-you-go” economics, we want to see fresh ideas that push the boundaries of what’s possible in digital payments. Think outside the box—your solution should inspire new thinking for the entire PYUSD ecosystem. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: PayPal\n                    Title: Creative Use of PYUSD in Applications\n                    Description: This award honors creative thinkers who push the boundaries of where and how PYUSD can be used in applications—whether social, gaming, education, finance, or something completely unexpected. This is all about thinking outside the wallet and uncovering new ways digital dollars can unlock value in apps and platforms. Whether it’s a beautifully designed wallet, a seamless onboarding journey, or something that goes viral within the community, this prize celebrates projects that put people first. Each Project Submission will be judged by a panel of judges in accordance with the following criteria: (a) Functionality: How well does this Project Submission work? What is the quality of the code? (b) Payments Applicability: How effectively does the solution address real-world payment challenges? (c) Novelty: How unique is this Project Submission’s concept? (d) UX: How well does this Project Submission utilize PYUSD’s performance and unique proposition to create great UX for downstream users? (e) Open-source: Is this Project Submission open-source? How well does the Project Submission compose with other primitives in the ecosystem? (f) Business Plan: Is there a viable business that can be built in the future around this Submission?\n                    Prizes: Not specified",
  "Company: 0G\n                    Title: Production-Ready Applications and Developer Tooling on 0G Mainnet\n                    Description: This track rewards developers who build production-ready applications and essential developer tooling directly on 0G Mainnet (EVM Chain). We want to see projects that demonstrate real-world utility and contribute to the 0G mainnet ecosystem's growth - whether through innovative dApps or tools that make building on 0G easier.\n                    Prizes: ['$3,000', '$2,500', '$2,000', '$1,500', '$1,000']",
  "Company: Self Protocol\n                    Title: Onchain Identity Verification with Self SDK\n                    Description: We are looking for interesting use cases of using the Self onchain SDK in your contracts. Self Smart contracts verify proofs, manage a merkle tree of identity commitments and allow for onchain disclosure of data while guaranteeing the permissionless aspect of the protocol. Using the Self.xyz SDK, allows a user to disclose their country, age (or range), that they are not on OFAC or from a sanctioned country, and verify that proof that onchain on the Celo network, or offchain, without sharing any private information with third parties. Since this month, you can not only prove your identity with your passport or ID, but Self has just launched Aadhaar card support, and we want to see your best use cases!\n                    Prizes: $5,000 for 1st place, $2,500 for 2nd place, $1,500 for 3rd place",
  "Company: Self Protocol\n                    Title: Offchain Identity Verification with Self SDK\n                    Description: Integrate Self offchain SDK into your application so users can prove their identity! Check out the Quickstart to see how quickly you can implement the Self SDK into your dApp.\n                    Prizes: Not specified",
  "Company: Fluence\n                    Title: Impactful Use of Fluence Virtual Servers\n                    Description: A total of $5,000 will be awarded to the most impactful use of Fluence Virtual Servers. Demonstrate a working project using CPU-only VMs from Fluence. Expectations include efficient AI application deployed on Fluence VMs, such as small/quantized models, inference APIs, agentic LLM backends. Ideally, build toward CPU-only compatibility, no GPUs required.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Kadena\n                    Title: Build a dApp or Developer Tool Harnessing Kadena’s Multiple Parallel Chains\n                    Description: Build a dApp or developer tool that harnesses Kadena’s multiple parallel chains. This could be a novel multichain dApp, a middleware that connects separate chains, or simple tooling to simplify multichain development. Show us how your project leverages the power of Kadena’s multi-chain model specifically.\n                    Prizes: Not specified",
  "Company: Kadena\n                    Title: Deploy a Unique dApp or Integration Connecting Kadena to External Ecosystems\n                    Description: Deploy a unique dApp or work on an integration that connects Kadena to external ecosystems. Whether you’re porting an existing Ethereum dApp (DeFi, NFT, gaming, DAO), building a brand new product from scratch, or integrating Kadena with wallets, liquidity layers, or middleware. Your product should show how Kadena can drive retail user adoption.\n                    Prizes: Not specified",
  "Company: Kadena\n                    Title: Design a Project for Institutional or TradFi Applications on Kadena\n                    Description: Design a project that shows how Kadena can power institutional or TradFi applications. This could include real-world assets (RWAs), tokenized securities, enterprise finance solutions, compliance-focused tooling, or infrastructure that bridges traditional finance with blockchain. The goal is to highlight Kadena’s potential in real-world, large-scale, and regulated environments.\n                    Prizes: Not specified",
  "Company: Ethereum Foundation\n                    Title: Unified ZK Registry System\n                    Description: Build solutions to unify registry systems across formats like documents proofs, passports, AA, etc.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: NFC Feature Exploration\n                    Description: Further developments on NFC feature integration with Mopro, such as utilizing chips embedded in ETHGlobal wristbands for proof generation, focusing on UX and DevEx.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Credential Sharing\n                    Description: Prove professional qualifications (degrees, licenses) stored as digitally signed PDFs and generate interesting use cases.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Mobile Gaming\n                    Description: ZK-based mobile games using the Mopro stack, such as ZK Escape Room, ZK Werewolf.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Ethereum Foundation\n                    Title: Matching Apps\n                    Description: Zero-knowledge powered matching applications across multiple domains like dating or job matching scenarios.\n                    Prizes: $2,000 for 1st place, $1,000 for 2nd place, $500 for 3rd place",
  "Company: Walrus\n                    Title: Applications that use Walrus storage\n                    Description: Focus on an app idea where decentralized storage solves a real pain point, examples include hosting for NFTs, democratized access to AI models, or crowdsourced video streaming.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Walrus\n                    Title: Developer tools for Walrus\n                    Description: Build something that helps developers integrate with Walrus more easily, such as SDKs, caching layers, streaming utilities, blob management tools, and more.\n                    Prizes: $2,500 for 1st place, $1,500 for 2nd place, $1,000 for 3rd place",
  "Company: Integra\n                    Title: Real Estate Tokenization and Compliance\n                    Description: Push boundaries in applying blockchain to real estate, from tokenization to compliance rails, asset registries to new user experiences, exploring how security tokens could transform real estate.\n                    Prizes: $1,000"
]